source/InformationRegisters/VKRDepartmentAccess.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>VKRDepartmentAccess</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Enabled</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>UserID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Department</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Podrazdeleniya</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

source/Enums/TipyKadrovykhIzmeneniy.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>TipyKadrovykhIzmeneniy</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Priem</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Perevod</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Uvolnenie</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IzmenenieDolzhnosti</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IzmenenieOklada</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IzmeneniePodrazdeleniya</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

source/Catalogs/Sotrudniki.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Sotrudniki</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>FIO</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TabelnyyNomer</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Organizatsiya</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Organizatsii</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Podrazdelenie</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Podrazdeleniya</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Dolzhnost</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Dolzhnosti</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Telefon</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataPriema</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Aktiven</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VKRSchedule</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GrafikiRaboty</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VKRCategory</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.KategoriiPersonala</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

source/Catalogs/GruppyPoluchateley.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>GruppyPoluchateley</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Opisanie</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>SostavGruppy</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Poluchatel</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.PoluchateliUvedomleniy</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Kommentariy</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

source/CommonModules/VKRDemo/Ext/Module.bsl
// Воспроизводимый учебный набор. Даты кадровых документов относятся к августу 2026 года.
// Технические даты подготовки, попыток и приёма SMTP записываются по фактическим часам платформы.

Функция НомерТекст(Номер)
    Возврат Прав("0" + СокрЛП(Строка(Номер)), 2);
КонецФункции

Функция Элемент(ИмяСправочника, Наименование, Поля)
    Менеджер = Справочники[ИмяСправочника];
    Ссылка = Менеджер.НайтиПоНаименованию(Наименование, Истина);
    Если НЕ Ссылка.Пустая() Тогда Возврат Ссылка; КонецЕсли;
    Объект = Менеджер.СоздатьЭлемент(); Объект.Наименование = Наименование;
    Для Каждого П Из Поля Цикл Объект[П.Ключ] = П.Значение; КонецЦикла;
    Объект.Записать(); Возврат Объект.Ссылка;
КонецФункции

Функция Группа(ИмяСправочника, Наименование)
    Менеджер = Справочники[ИмяСправочника];
    Ссылка = Менеджер.НайтиПоНаименованию(Наименование, Истина);
    Если НЕ Ссылка.Пустая() Тогда Возврат Ссылка; КонецЕсли;
    Объект = Менеджер.СоздатьГруппу(); Объект.Наименование = Наименование;
    Объект.Записать(); Возврат Объект.Ссылка;
КонецФункции

Функция Пользователь(Имя, ПолноеИмя, Роль)
    П = ПользователиИнформационнойБазы.НайтиПоИмени(Имя);
    Если П = Неопределено Тогда
        П = ПользователиИнформационнойБазы.СоздатьПользователя();
        П.Имя = Имя; П.ПолноеИмя = ПолноеИмя;
        П.АутентификацияСтандартная = Истина; П.АутентификацияОС = Ложь;
        П.Роли.Добавить(Метаданные.Роли[Роль]); П.Записать();
    КонецЕсли;
    Возврат П;
КонецФункции

Процедура РазрешитьПодразделение(Пользователь, Подразделение)
    Доступ = РегистрыСведений.VKRDepartmentAccess.СоздатьМенеджерЗаписи();
    Доступ.UserID = Строка(Пользователь.УникальныйИдентификатор);
    Доступ.Department = Подразделение; Доступ.Enabled = Истина; Доступ.Записать();
КонецПроцедуры

Процедура ПодготовитьПользователей()
    Пользователь("vkr_Administrator", "Администратор стенда", "Administrator");
    Пользователь("vkr_Kadrovik", "Кадровик", "Kadrovik");
    Пользователь("vkr_OperatorUvedomleniy", "Оператор уведомлений", "OperatorUvedomleniy");
    Пользователь("vkr_Auditor", "Аудитор", "Auditor");
    Отделы = НаименованияОтделов();
    Для Индекс = 0 По 9 Цикл
        Имя = ?(Индекс = 0, "vkr_RukovoditelPodrazdeleniya", ?(Индекс = 1, "vkr_Manager_B", "vkr_Manager_" + НомерТекст(Индекс + 1)));
        П = Пользователь(Имя, "Руководитель: " + Отделы[Индекс], "RukovoditelPodrazdeleniya");
        Отдел = Справочники.Podrazdeleniya.НайтиПоНаименованию(Отделы[Индекс], Истина);
        Если НЕ Отдел.Пустая() Тогда РазрешитьПодразделение(П, Отдел); КонецЕсли;
    КонецЦикла;
    Пользователь("vkr_Manager_None", "Руководитель без назначенного подразделения", "RukovoditelPodrazdeleniya");
КонецПроцедуры

Функция НаименованияОтделов()
    Возврат СтрРазделить("Отдел кадров,Расчётная группа,Отдел разработки,Служба сопровождения,ИТ-служба,Отдел продаж,Отдел закупок,Финансовый отдел,Документооборот,Служба качества", ",");
КонецФункции

Функция Создать() Экспорт
    Если НЕ ПравоДоступа("Администрирование", Метаданные) Тогда
        ВызватьИсключение "Учебные данные создаёт администратор.";
    КонецЕсли;
    Если Константы.VKRSendEnabled.Получить() Тогда
        ВызватьИсключение "Перед созданием учебных данных остановите отправку.";
    КонецЕсли;
    Если НЕ Справочники.Sotrudniki.НайтиПоНаименованию("Учебный сотрудник 01", Истина).Пустая() Тогда
        ПодготовитьПользователей();
        Возврат "Учебный набор уже существует. Документы и очередь сохранены без изменений.";
    КонецЕсли;
    ПроверкаБазы = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник.Sotrudniki");
    Если НЕ ПроверкаБазы.Выполнить().Пустой() Тогда
        ВызватьИсключение "Этот набор создаётся в отдельной пустой учебной базе.";
    КонецЕсли;
    НачатьТранзакцию();
    Попытка
        Константы.VKRSendEnabled.Установить(Ложь);
        Константы.VKRMaxAttempts.Установить(3); Константы.VKRRetrySeconds.Установить(60);
        Отделы = Новый Массив; Должности = Новый Массив; Сотрудники = Новый Массив;
        Получатели = Новый Массив; Причины = Новый Массив; Основания = Новый Массив;
        Каналы = Новый Массив; Назначения = Новый Массив;
        ИменаОтделов = НаименованияОтделов();
        ИменаДолжностей = СтрРазделить("Специалист по кадрам,Бухгалтер,Разработчик,Специалист сопровождения,Системный администратор,Менеджер по продажам,Специалист по закупкам,Экономист,Делопроизводитель,Специалист по качеству", ",");
        ИменаКатегорий = СтрРазделить("Кадровый персонал,Расчётный персонал,Разработчики,Специалисты сопровождения,Администраторы систем,Коммерческий персонал,Снабжение,Экономический персонал,Документационное обеспечение,Контроль качества", ",");
        ИменаПричин = СтрРазделить("Приём по трудовому договору,Перевод по соглашению сторон,Изменение организационной структуры,Изменение штатного расписания,Профессиональное развитие,Временное замещение,Индексация оплаты труда,Изменение трудовой функции,Заявление сотрудника,Завершение трудового договора", ",");
        ИменаОснований = СтрРазделить("Приказ о приёме,Приказ о переводе,Приказ об увольнении,Приказ об изменении должности,Приказ об изменении подразделения,Приказ об изменении оклада,Дополнительное соглашение,Заявление сотрудника,Служебная записка,Решение об изменении штатного расписания", ",");
        ГруппаОтделов = Группа("Podrazdeleniya", "Подразделения учебного контура");
        ГруппаДолжностей = Группа("Dolzhnosti", "Должности учебного контура");
        ГруппаШаблонов = Группа("ShablonyPisem", "Шаблоны кадровых уведомлений");
        ГруппаАдресатов = Группа("GruppyPoluchateley", "Маршруты учебной рассылки");
        Для Индекс = 0 По 9 Цикл
            Номер = НомерТекст(Индекс + 1);
            Организация = Элемент("Organizatsii", "Учебная организация " + Номер, Новый Структура("Adres,Email", "Демонстрационные сведения", "org" + Номер + "@example.test"));
            Отделы.Добавить(Элемент("Podrazdeleniya", ИменаОтделов[Индекс], Новый Структура("Родитель,KodPodrazdeleniya", ГруппаОтделов, Номер)));
            Должности.Добавить(Элемент("Dolzhnosti", ИменаДолжностей[Индекс], Новый Структура("Родитель,Kategoriya,BazovyyOklad", ГруппаДолжностей, ИменаКатегорий[Индекс], 60000 + Индекс * 3000)));
            Категория = Элемент("KategoriiPersonala", ИменаКатегорий[Индекс], Новый Структура("Opisanie", "Классификация сотрудника в учебном кадровом контуре"));
            График = Элемент("GrafikiRaboty", "Рабочий график " + Номер, Новый Структура("KolichestvoRabochikhDney,Opisanie", 5, "Пятидневная неделя; учебный вариант " + Номер));
            Сотрудники.Добавить(Элемент("Sotrudniki", "Учебный сотрудник " + Номер,
                Новый Структура("FIO,TabelnyyNomer,Organizatsiya,Podrazdelenie,Dolzhnost,Email,DataPriema,Aktiven,VKRSchedule,VKRCategory",
                "Учебный сотрудник " + Номер, Номер, Организация, Отделы[Индекс], Должности[Индекс], "employee" + Номер + "@example.test", Дата(2026,8,10), Истина, График, Категория)));
            Получатели.Добавить(Элемент("PoluchateliUvedomleniy", "Ответственный адресат " + Номер,
                Новый Структура("FIO,Email,Dolzhnost,Podrazdelenie,Aktiven", "Ответственный адресат " + Номер, "recipient" + Номер + "@example.test", Должности[Индекс], Отделы[Индекс], Истина)));
            Причины.Добавить(Элемент("PrichinyKadrovykhIzmeneniy", ИменаПричин[Индекс], Новый Структура("Opisanie", "Причина кадрового события в учебном примере")));
            Основания.Добавить(Элемент("VidyDokumentovOsnovaniy", ИменаОснований[Индекс], Новый Структура("Opisanie", "Классификатор документа основания")));
            Профиль = Элемент("SMTPServery", "Локальный почтовый профиль " + Номер,
                Новый Структура("Server,Port,EmailOtpravitelya,TestovyyRezhim", "127.0.0.1", 1025, "hr" + Номер + "@example.test", Истина));
            Если Индекс = 0 Тогда Константы.VKRSMTPProfile.Установить(Профиль); КонецЕсли;
            Каналы.Добавить(Элемент("KanalyUvedomleniy", "Email: " + ИменаОтделов[Индекс], Новый Структура("Aktiven,Opisanie,VKRSMTPProfile", Истина, "Локальный канал кадровых уведомлений", Профиль)));
            Назначения.Добавить(Элемент("TipyUvedomleniy", "Кадровая информация: " + ИменаОтделов[Индекс], Новый Структура("Opisanie", "Служебное оповещение ответственных лиц")));
        КонецЦикла;
        Дубликат = Элемент("PoluchateliUvedomleniy", "Дубликат первого адреса", Новый Структура("FIO,Email,Podrazdelenie,Aktiven", "Проверка дубликата", "recipient01@example.test", Отделы[0], Истина));
        Неактивный = Элемент("PoluchateliUvedomleniy", "Неактивный адресат", Новый Структура("FIO,Email,Podrazdelenie,Aktiven", "Проверка отключённого адресата", "disabled@example.test", Отделы[0], Ложь));
        Типы = СтрРазделить("Priem,Perevod,Uvolnenie,IzmenenieDolzhnosti,IzmeneniePodrazdeleniya,IzmenenieOklada,Priem,Perevod,IzmenenieDolzhnosti,IzmenenieOklada", ",");
        ИменаВидов = СтрРазделить("Приём,Перевод,Увольнение,Изменение должности,Изменение подразделения,Изменение оклада,Приём на временную работу,Временный перевод,Повышение в должности,Индексация оклада", ",");
        Виды = Новый Массив;
        Для Индекс = 0 По 9 Цикл
            Вид = Элемент("VidyKadrovykhIzmeneniy", ИменаВидов[Индекс], Новый Структура("TipIzmeneniya,TrebuyetUvedomleniya,VKRDefault", Перечисления.TipyKadrovykhIzmeneniy[Типы[Индекс]], Истина, Индекс < 6));
            Виды.Добавить(Вид);
            Шаблон = Элемент("ShablonyPisem", ИменаВидов[Индекс] + ": уведомление", Новый Структура("Родитель,TemaPisma,TekstPisma,Aktiven", ГруппаШаблонов,
                "{{EventType}}: {{EmployeeName}}", "Кадровое событие: {{EventType}}. Сотрудник: {{EmployeeName}}. Дата изменения: {{EffectiveDate}}. Основание: {{SourceKind}}. Причина: {{Reason}}.", Истина));
            Адресаты = Справочники.GruppyPoluchateley.СоздатьЭлемент(); Адресаты.Родитель = ГруппаАдресатов;
            Адресаты.Наименование = ИменаВидов[Индекс] + ": ответственные";
            Адресаты.SostavGruppy.Добавить().Poluchatel = Получатели[Индекс];
            Адресаты.SostavGruppy.Добавить().Poluchatel = Получатели[(Индекс + 1) % 10];
            Если Индекс = 0 Тогда
                Адресаты.SostavGruppy.Добавить().Poluchatel = Дубликат;
                Адресаты.SostavGruppy.Добавить().Poluchatel = Неактивный;
            КонецЕсли;
            Адресаты.Записать();
            Элемент("PravilaRassylki", ИменаВидов[Индекс] + ": правило", Новый Структура("VidIzmeneniya,GruppaPoluchateley,ShablonPisma,Aktivno,VKRChannel,VKRNotificationType", Вид, Адресаты.Ссылка, Шаблон, Истина, Каналы[Индекс], Назначения[Индекс]));
        КонецЦикла;
        ДокументыИсточники = СтрРазделить("PriemSotrudnika,PerevodSotrudnika,UvolnenieSotrudnika,IzmenenieDolzhnosti,IzmeneniePodrazdeleniya,IzmenenieOklada", ",");
        Для НомерСотрудника = 0 По 9 Цикл
            Для Индекс = 0 По 5 Цикл
                НомерВида = Индекс;
                Если НомерСотрудника >= 5 Тогда
                    Если Индекс = 0 Тогда НомерВида = 6;
                    ИначеЕсли Индекс = 1 Тогда НомерВида = 7;
                    ИначеЕсли Индекс = 3 Тогда НомерВида = 8;
                    ИначеЕсли Индекс = 5 Тогда НомерВида = 9;
                    КонецЕсли;
                КонецЕсли;
                Д = Документы[ДокументыИсточники[Индекс]].СоздатьДокумент();
                ДеньСобытия = ?(Индекс = 2, 5, ?(Индекс > 2, Индекс - 1, Индекс));
                Д.Дата = Дата(2026,8,10) + ДеньСобытия * 86400 + НомерСотрудника * 60;
                Д.Sotrudnik = Сотрудники[НомерСотрудника];
                Д.Osnovanie = "Учебный пример " + Строка(НомерСотрудника + 1) + "/" + Строка(Индекс + 1);
                Д.VKRReason = Причины[(НомерСотрудника + Индекс) % 10];
                Д.VKRSourceKind = Основания[(НомерСотрудника + Индекс) % 10];
                Д.VKRChangeKind = Виды[НомерВида];
                Поля = Новый Структура;
                Для Каждого ИмяДаты Из СтрРазделить("DataPriema,DataPerevoda,DataUvolneniya,DataIzmeneniya", ",") Цикл Поля.Вставить(ИмяДаты, НачалоДня(Д.Дата)); КонецЦикла;
                Поля.Вставить("Podrazdelenie", Отделы[НомерСотрудника]); Поля.Вставить("PodrazdelenieDo", Отделы[НомерСотрудника]);
                Поля.Вставить("PodrazdeleniePosle", Отделы[(НомерСотрудника + 1) % 10]);
                Поля.Вставить("Dolzhnost", Должности[НомерСотрудника]); Поля.Вставить("DolzhnostDo", Должности[НомерСотрудника]);
                Поля.Вставить("DolzhnostPosle", Должности[(НомерСотрудника + 1) % 10]);
                Поля.Вставить("Oklad", 60000 + НомерСотрудника * 3000); Поля.Вставить("OkladDo", 60000 + НомерСотрудника * 3000); Поля.Вставить("OkladPosle", 65000 + НомерСотрудника * 3000);
                Для Каждого П Из Поля Цикл Если Д.Метаданные().Реквизиты.Найти(П.Ключ) <> Неопределено Тогда Д[П.Ключ] = П.Значение; КонецЕсли; КонецЦикла;
                Д.Записать(РежимЗаписиДокумента.Проведение);
            КонецЦикла;
        КонецЦикла;
        ЗафиксироватьТранзакцию();
    Исключение
        ОтменитьТранзакцию(); ВызватьИсключение;
    КонецПопытки;
    ПодготовитьПользователей();
    Возврат "Созданы 10 сотрудников, 60 кадровых событий и 120 уведомлений. Учебный период: 10–15 августа 2026 года. Отправка выключена.";
КонецФункции
